drop table if exists book;

create table Book
(
    id serial not NULL PRIMARY KEY,
    title VARCHAR(100) NOT NULL,
    year integer,
    author VARCHAR(20),
    watched boolean DEFAULT false NOT NULL
);

CREATE UNIQUE INDEX books_title_uindex ON book (title);

INSERT INTO book ("title","year","author",watched)
VALUES
('Мастер и Маргарита', 1940, 'Булгаков М.А.', true),
('Преступление и наказание', 1866, 'Достоевский Ф.М.', true),
('Война и мир', 1868, 'Толстой Л.Н.', false),
('Собачье сердце', 1925, 'Булгаков М.А.', false),
('Мёртвые души', 1842, 'Гоголь Н.В.', false),
('Братья Карамазовы', 1880, 'Достоевский Ф.М.', true),
('Идиот', 1869, 'Достоевский Ф.М.', true),
('Отцы и дети', 1861, 'Тургенев И.С.', true),
('Три товарища', 1936, 'Ремарк Э.М.', true),
('Граф Монте-Кристо', 1845, 'Дюма А.', true),
('Анна Каренина', 1877, 'Толстой Л.Н.', true),
('Отверженные', 1862, 'Гюго В.М.', true),
('Евгений Онегин', 1837, 'Пушкин А.С.', true),
('Горе от ума', 1828, 'Грибоедов А.С.', true),
('Палата № 6', 1892, 'Чехов А.П.', true),
('Ревизор', 1836, 'Гоголь Н.В.', true),
('Триумфальная арка', 1945, 'Ремарк Э.М.', true),
('Повести Белкина', 1831, 'Пушкин А.С.', true),
('Бесы', 1872, 'Достоевский Ф.М.', true),
('Подросток', 1875, 'Достоевский Ф.М.', true),
('Капитанская дочка', 1836, 'Пушкин А.С.', true),
('Бесы1', 1872, 'Достоевский Ф.М.', true),
('Бесы2', 1872, 'Достоевский Ф.М.', true),
('Бесы3', 1872, 'Достоевский Ф.М.', true),
('Бесы4', 1872, 'Достоевский Ф.М.', true),
('Бесы5', 1872, 'Достоевский Ф.М.', true),
('Бесы6', 1872, 'Достоевский Ф.М.', true),
('Бесы7', 1872, 'Достоевский Ф.М.', true),
('Бесы8', 1872, 'Достоевский Ф.М.', true),
('Бесы9', 1872, 'Достоевский Ф.М.', true),
('Бесы10', 1872, 'Достоевский Ф.М.', true),
('Бесы11', 1872, 'Достоевский Ф.М.', true);
